Repository: aleksander42195-boop/cuddly-adventure
Catalog: LifehackApp/Resources/Localization/*.lproj/Localizable.strings
Languages: nb

# today.title
source: Today
nb: I dag

# nutrition.title
source: Nutrition
nb: Ernæring

# settings.title
source: Settings
nb: Innstillinger

# metrics.energy
source: Energy
nb: Energi

# metrics.battery
source: Battery
nb: Batteri

# metrics.restingHR.steps.format
source: Resting HR: %1$@ bpm · Steps: %2$@
nb: Hvilepuls: %1$@ bpm · Skritt: %2$@

# action.refresh.health
source: Refresh from Health
nb: Oppdater fra Helse

# action.save
source: Save
nb: Lagre

# action.clear
source: Clear
nb: Tøm

# action.request.health.access
source: Request Health Access
nb: Be om Helse‑tilgang

# action.set.goal
source: Set Goal
nb: Sett mål

# action.save.key
source: Save Key
nb: Lagre nøkkel

# action.save.keychain
source: Save (Keychain)
nb: Lagre (Keychain)

# action.save.userdefaults
source: Save (UserDefaults)
nb: Lagre (UserDefaults)

# nutrition.intake.format
source: Intake: %1$@ kcal / %2$@
nb: Inntak: %1$@ kcal / %2$@

# nutrition.placeholder
source: Extend later with macros and logging.
nb: Utvid senere med makroer og logging.

# journal.intro
source: Daily logs, HRV series, mood and notes coming here.
nb: Dagslogger, HRV-serier, humør og notater kommer her.

# journal.new.note
source: New Note
nb: Nytt notat

# journal.save.note
source: Save
nb: Lagre

# coach.placeholder.question
source: Ask your coach…
nb: Spør coachen…

# coach.role.user
source: You
nb: Du

# coach.api.key.missing.title
source: Missing OpenAI API key
nb: Mangler OpenAI API‑nøkkel

# coach.api.key.missing.body
source: Paste your key to enable real coach answers. Stored securely in Keychain.
nb: Lim inn nøkkelen for å aktivere ekte coach‑svar. Lagres sikkert i Keychain.

# coach.api.key.saved
source: Key saved. You can now ask questions.
nb: Nøkkel lagret. Du kan nå stille spørsmål.

# coach.api.key.save.error.format
source: Failed to store key: %1$@
nb: Feil ved lagring av nøkkel: %1$@

# coach.api.key.missing.inline
source: Missing OpenAI API key. Go to Settings → Coach API and save it.
nb: Mangler OpenAI API‑nøkkel. Gå til Innstillinger → Coach API.

# coach.message.empty.response
source: Empty answer – try again with more context.
nb: Tomt svar – prøv igjen med mer kontekst.

# settings.section.general
source: General
nb: Generelt

# settings.section.coach.engine
source: Coach Engine
nb: Coach‑motor

# settings.section.health
source: Health
nb: Helse

# settings.section.coach.api.key
source: Coach API Key
nb: Coach API‑nøkkel

# settings.haptics
source: Haptics
nb: Haptikk

# settings.healthkit.status.authorized
source: Authorized
nb: Godkjent

# settings.healthkit.status.unauthorized
source: Not authorized
nb: Ikke godkjent

# settings.engine.help
source: • Completions: classic chat engine (simple & quick) • Responses: newer API with 'items', useful for extensions
nb: • Completions: klassisk chat‑motor (enkelt og raskt) • Responses: nyere API med «items», nyttig for utvidelser

# error.missing.apikey
source: Missing OpenAI API key.
nb: Mangler OpenAI API‑nøkkel.

# error.openai.generic.format
source: OpenAI error: %1$@
nb: OpenAI‑feil: %1$@

# accessibility.today.summary.format
source: Today metrics. Stress %1$@ percent. Energy %2$@ percent. Battery %3$@ percent. HRV %4$@. Steps %5$@.
nb: Dagens målinger. Stress %1$@ prosent. Energi %2$@ prosent. Batteri %3$@ prosent. HRV %4$@. Skritt %5$@.

# accessibility.coach.chat.count.format
source: Coach chat with %1$@ messages.
nb: Coach‑chat med %1$@ meldinger.

# app.version
source: Version
nb: Versjon
